# -*- coding:utf-8 -*-
#Pyhton 如何存储信息
#Python如何做基本数字运算
#Python如何比较数字
#什么时候使用Python解决数学问题


###基本的数据类型
# int : 整数   ： 1,-1 
#float: 浮点数 ：  3.14,-2.8
# long: 非常大的数 : 1000000000
# string: 存储字母、数字、空格、符号 :"Hello"、“42”
# list: 用方括号括住的一组项，并且项之间用逗号分隔： [1,2,3]  ["ee","rre"] ["Hello",5]
# tuple: 用圆括号括住的项的列表，这些项不能改变。
#通常，tuple保存的值全都是相关的，例如，人的生日、喜欢的颜色、名字： （1，2，3）,(),("ee","qq"),("hello",5)
#dictionary:已经配对的键和值的列表，用花括号括住：  {'apple':'red','sky':'blue'}


a = 5 
print(a)

#获取数据类型
print(type(a)) 

x = 5 + 1
print(x)

#python 中常用的运算符
# 加法 +  1+1    2
# 减法 -  2-1    1
# 乘法 *  5*2    10
# 除法 /  6/2    3
# Floor除法 //  13//2   6
# 模除 %     13%2    1
# 取反 -     a = 5   -a   -1
# 绝对值 abs()   abs(-5)  5
# 求幂 **  2**6   64

#表达式中只有整数时，返回整数；如果存在浮点数，则返回浮点数。

#python常用的比较运算符
#==、!=、>、<、>=、<=




